emacs.org
#+TITLE:     Rick Dillon's Emacs Initialization File
#+AUTHOR:    R. P. Dillon
#+EMAIL:     rpdillon@etherplex.org
#+DATE:      2010-07-10 Sat
#+DESCRIPTION: 
#+KEYWORDS: 
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:t toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:nil skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:   
#+LINK_HOME: 

* Custom Functions
** Platform-independent Path Costruction
If you have a collection of code that you want to load at startup, you tend to want to modify the =load-path= variable by adding paths of your own.  This can be cumbersome, so this function automatically chains together the path-handling calls to reduce unwieldy calls later.  You simply call it with the path elements you want to construct, in order:
#+begin_src emacs-lisp :tangle no
(construct-path "~" "foo" "bar" "baz.txt")
#+end_src
You can see more of how it's used in the section on [[#load-path-setup][Load Path Setup]]
#+begin_src emacs-lisp
(defun construct-path (&rest path-elements)
  (defun inner (elements)
    (print (car elements))
    (if (eq (cdr elements) nil)
        (expand-file-name (car elements))
      (expand-file-name (car elements) (inner (cdr elements)))))
  (inner (reverse path-elements)))
#+end_src

** Multi-buffer Search
Sometimes you want to execute a search across all your open buffers, for example when you have a collection of related files and need to find a refernce to a particular word or phrase (writing) or variable or function (programming).  This is an interactive function that does exactly that.
#+begin_src emacs-lisp
(defun search (regexp)
  "Search all buffers for a regexp."
  (interactive "sRegexp to search for: ")
  (multi-occur-in-matching-buffers ".*" regexp))
#+end_src
** Flyspell Convenience Function
When =flyspell-mode= is activated, it doesn't go back and check the entire current buffer for spelling errors.  This is a helper function that turns on flyspell, and goes back and checks the current buffer for spelling errors after doing so.
#+begin_src emacs-lisp
(defun flyspell-on ()
  (interactive)
  (flyspell-mode 1)
  (flyspell-buffer))
#+end_src
* Load Path Setup
  :PROPERTIES:
  :CUSTOM_ID: load-path-setup
  :END:
This file makes use of a variety of modes and code that are included under the =src= sub-directory of my =.emacs.d= directory.  This code adds those directories so the rest of the file can be executed smoothly.

#+begin_src emacs-lisp
  (add-to-list 'load-path (construct-path (file-name-directory (or (buffer-file-name) load-file-name)) "src" "org-mode" "lisp"))
  (add-to-list 'load-path (construct-path (file-name-directory (or (buffer-file-name) load-file-name)) "src" "org-mode" "contrb" "lisp"))
  (add-to-list 'load-path (construct-path (file-name-directory (or (buffer-file-name) load-file-name)) "src"))
#+end_src
** ELPA Initialization
ELPA is a package manager for Emacs, and I've loaded a variety of add-on packages through ELPA.  Some of them, like =idle-require= I make use of in this file, so rather than initialize ELPA at the end of the file, I initialize it here, before I set up everything else.
#+begin_src emacs-lisp
  (when (load (construct-path "~" ".emacs.d" "elpa" "package.el")) (package-initialize))
#+end_src
* Editor Behavior
** Prevent backups from littering the file system
By default, Emacs provides fairly robust backup file (files that end with a ~) support, but it leaves those files in the same directories alongside the originals.  This is a customization that gathers all the backups into one spot, so you can find them in one place, and don't have to worry about, e.g. your version control system commiting them by accident.
#+begin_src emacs-lisp
(setq backup-directory-alist `(("." . ,(construct-path "~" "emacsbackup"))))
#+end_src

** Region selection
The newer versions of Emacs (version 23+), turn on a more common but less powerful mode for text selection called =transient-mark-mode=, which only supplies an active region when text is selected.  This disables that mode in favor of the traditional Emacs behavior.
#+begin_src emacs-lisp
(transient-mark-mode 0)
#+end_src

** Clipboard Behavior
Emacs maintains a kill-ring independent of the system clipboard.  This can be useful or annoying, and I tend to find it annoying.  This variable combines the two clipboards to they interoperate.
#+begin_src emacs-lisp
(setq-default x-select-enable-clipboard t)
#+end_src
