emacs.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Rick Dillon's Emacs Initialization File</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2010-07-10 Sat"/>
<meta name="author" content="R. P. Dillon"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">Rick Dillon's Emacs Initialization File</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Custom Functions </a>
<ul>
<li><a href="#sec-1_1">1.1 Platform-independent Path Costruction </a></li>
<li><a href="#sec-1_2">1.2 Multi-buffer Search </a></li>
<li><a href="#sec-1_3">1.3 Flyspell Convenience Function </a></li>
</ul>
</li>
<li><a href="#load-path-setup">2 Load Path Setup </a>
<ul>
<li><a href="#sec-2_1">2.1 ELPA Initialization </a></li>
</ul>
</li>
<li><a href="#sec-3">3 Editor Behavior </a>
<ul>
<li><a href="#sec-3_1">3.1 Prevent backups from littering the file system </a></li>
<li><a href="#sec-3_2">3.2 Region selection </a></li>
<li><a href="#sec-3_3">3.3 Clipboard Behavior </a></li>
<li><a href="#sec-3_4">3.4 Meta Key Modifications </a></li>
<li><a href="#sec-3_5">3.5 Syntax Highlighting </a></li>
<li><a href="#sec-3_6">3.6 Tabs Handling </a></li>
<li><a href="#sec-3_7">3.7 Minibuffer Handling </a></li>
<li><a href="#sec-3_8">3.8 Modeline Information </a></li>
<li><a href="#sec-3_9">3.9 Scrolling </a></li>
<li><a href="#sec-3_10">3.10 Paretheses </a></li>
<li><a href="#sec-3_11">3.11 Line Wrapping </a></li>
<li><a href="#sec-3_12">3.12 Emacs Server </a></li>
<li><a href="#sec-3_13">3.13 Applications </a>
<ul>
<li><a href="#sec-3_13_1">3.13.1 Sunrise Commander </a></li>
</ul>
</li>
<li><a href="#sec-3_14">3.14 Modes </a>
<ul>
<li><a href="#sec-3_14_1">3.14.1 ANSI Color in Terminals </a></li>
<li><a href="#sec-3_14_2">3.14.2 <code>recentf</code> Setup </a></li>
<li><a href="#sec-3_14_3">3.14.3 Org-Remember </a></li>
</ul>
</li>
<li><a href="#sec-3_15">3.15 Accelerators </a></li>
<li><a href="#sec-3_16">3.16 GUI Settings </a></li>
<li><a href="#sec-3_17">3.17 End of File Newlines </a></li>
<li><a href="#sec-3_18">3.18 Advanced Commands </a></li>
<li><a href="#sec-3_19">3.19 Color Themes </a></li>
</ul>
</li>
<li><a href="#sec-4">4 Location-specific Settings </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Custom Functions </h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1_1" class="outline-3">
<h3 id="sec-1_1"><span class="section-number-3">1.1</span> Platform-independent Path Costruction </h3>
<div class="outline-text-3" id="text-1_1">

<p>If you have a collection of code that you want to load at startup, you tend to want to modify the <code>load-path</code> variable by adding paths of your own.  This can be cumbersome, so this function automatically chains together the path-handling calls to reduce unwieldy calls later.  You simply call it with the path elements you want to construct, in order:
</p>


<pre class="src src-emacs-lisp">(construct-path <span style="color: #ffa07a;">"~"</span> <span style="color: #ffa07a;">"foo"</span> <span style="color: #ffa07a;">"bar"</span> <span style="color: #ffa07a;">"baz.txt"</span>)
</pre>


<p>
You can see more of how it's used in the section on <a href="#load-path-setup">Load Path Setup</a>
</p>


<pre class="src src-emacs-lisp">(<span style="color: #00ffff;">defun</span> <span style="color: #87cefa;">construct-path</span> (<span style="color: #98fb98;">&amp;rest</span> path-elements)
  (<span style="color: #00ffff;">defun</span> <span style="color: #87cefa;">inner</span> (elements)
    (print (car elements))
    (<span style="color: #00ffff;">if</span> (eq (cdr elements) nil)
        (expand-file-name (car elements))
      (expand-file-name (car elements) (inner (cdr elements)))))
  (inner (reverse path-elements)))
</pre>



</div>

</div>

<div id="outline-container-1_2" class="outline-3">
<h3 id="sec-1_2"><span class="section-number-3">1.2</span> Multi-buffer Search </h3>
<div class="outline-text-3" id="text-1_2">

<p>Sometimes you want to execute a search across all your open buffers, for example when you have a collection of related files and need to find a refernce to a particular word or phrase (writing) or variable or function (programming).  This is an interactive function that does exactly that.
</p>


<pre class="src src-emacs-lisp">(<span style="color: #00ffff;">defun</span> <span style="color: #87cefa;">search</span> (regexp)
  <span style="color: #ffa07a;">"Search all buffers for a regexp."</span>
  (interactive <span style="color: #ffa07a;">"sRegexp to search for: "</span>)
  (multi-occur-in-matching-buffers <span style="color: #ffa07a;">".*"</span> regexp))
</pre>


</div>

</div>

<div id="outline-container-1_3" class="outline-3">
<h3 id="sec-1_3"><span class="section-number-3">1.3</span> Flyspell Convenience Function </h3>
<div class="outline-text-3" id="text-1_3">

<p>When <code>flyspell-mode</code> is activated, it doesn't go back and check the entire current buffer for spelling errors.  This is a helper function that turns on flyspell, and goes back and checks the current buffer for spelling errors after doing so.
</p>


<pre class="src src-emacs-lisp">(<span style="color: #00ffff;">defun</span> <span style="color: #87cefa;">flyspell-on</span> ()
  (interactive)
  (flyspell-mode 1)
  (flyspell-buffer))
</pre>


</div>
</div>

</div>

<div id="outline-container-load-path-setup" class="outline-2">
<h2 id="load-path-setup"><a name="sec-2" id="sec-2"></a><span class="section-number-2">2</span> Load Path Setup </h2>
<div class="outline-text-2" id="text-load-path-setup">

<p>This file makes use of a variety of modes and code that are included under the <code>src</code> sub-directory of my <code>.emacs.d</code> directory.  This code adds those directories so the rest of the file can be executed smoothly.
</p>



<pre class="src src-emacs-lisp">(add-to-list 'load-path (construct-path (file-name-directory (or (buffer-file-name) load-file-name)) <span style="color: #ffa07a;">"src"</span> <span style="color: #ffa07a;">"org-mode"</span> <span style="color: #ffa07a;">"lisp"</span>))
(add-to-list 'load-path (construct-path (file-name-directory (or (buffer-file-name) load-file-name)) <span style="color: #ffa07a;">"src"</span> <span style="color: #ffa07a;">"org-mode"</span> <span style="color: #ffa07a;">"contrb"</span> <span style="color: #ffa07a;">"lisp"</span>))
(add-to-list 'load-path (construct-path (file-name-directory (or (buffer-file-name) load-file-name)) <span style="color: #ffa07a;">"src"</span>))
</pre>



</div>

<div id="outline-container-2_1" class="outline-3">
<h3 id="sec-2_1"><span class="section-number-3">2.1</span> ELPA Initialization </h3>
<div class="outline-text-3" id="text-2_1">

<p>ELPA is a package manager for Emacs, and I've loaded a variety of add-on packages through ELPA.  Some of them, like <code>idle-require</code> I make use of in this file, so rather than initialize ELPA at the end of the file, I initialize it here, before I set up everything else.
</p>


<pre class="src src-emacs-lisp">(<span style="color: #00ffff;">when</span> (load (construct-path <span style="color: #ffa07a;">"~"</span> <span style="color: #ffa07a;">".emacs.d"</span> <span style="color: #ffa07a;">"elpa"</span> <span style="color: #ffa07a;">"package.el"</span>)) (package-initialize))
</pre>


</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Editor Behavior </h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3_1" class="outline-3">
<h3 id="sec-3_1"><span class="section-number-3">3.1</span> Prevent backups from littering the file system </h3>
<div class="outline-text-3" id="text-3_1">

<p>By default, Emacs provides fairly robust backup file (files that end with a ~) support, but it leaves those files in the same directories alongside the originals.  This is a customization that gathers all the backups into one spot, so you can find them in one place, and don't have to worry about, e.g. your version control system commiting them by accident.
</p>


<pre class="src src-emacs-lisp">(setq backup-directory-alist `((<span style="color: #ffa07a;">"."</span> . ,(construct-path <span style="color: #ffa07a;">"~"</span> <span style="color: #ffa07a;">"emacsbackup"</span>))))
</pre>



</div>

</div>

<div id="outline-container-3_2" class="outline-3">
<h3 id="sec-3_2"><span class="section-number-3">3.2</span> Region selection </h3>
<div class="outline-text-3" id="text-3_2">

<p>The newer versions of Emacs (version 23+), turn on a more common but less powerful mode for text selection called <code>transient-mark-mode</code>, which only supplies an active region when text is selected.  This disables that mode in favor of the traditional Emacs behavior.
</p>


<pre class="src src-emacs-lisp">(transient-mark-mode 0)
</pre>



</div>

</div>

<div id="outline-container-3_3" class="outline-3">
<h3 id="sec-3_3"><span class="section-number-3">3.3</span> Clipboard Behavior </h3>
<div class="outline-text-3" id="text-3_3">

<p>Emacs maintains a kill-ring independent of the system clipboard.  This can be useful or annoying, and I tend to find it annoying.  This variable combines the two clipboards to they interoperate.
</p>


<pre class="src src-emacs-lisp">(setq-default x-select-enable-clipboard t)
</pre>


</div>

</div>
