emacs.org
** Meta Key Modifications
On many platform/keyboard combinations, keys are not placed conveniently for use in Emacs.  Specifically, the control key is often placed in the lower left corner of the keyboard, which can cause strain.  This is usually rebound to a more convenient location (like the key that most modern keyboards assign to Caps Lock).  The other key that sometimes causes issues is the Meta key, and that is what we address here.  If you're using Emacs on Apple hardware with an Apple keyboard, for example, the "Command" key should be treated as Meta.  This can be effected with:
#+begin_src emacs-lisp :tangle no
(setq ns-command-modifier (quote meta))
#+end_src
It's worth noting that this variable doesn't even exist on non-Apple platforms, and may or may not be present in alternative builds like Carbon Emacs and Aquamacs, which have their own methods for handling Meta key behavior on Apple platforms.

Similar techniques can be used to assign Meta on Linux, as well:
#+begin_src emacs-lisp :tangle no
(setq x-alt-keysym 'meta)
(setq x-super-keysym 'meta)
#+end_src
** Syntax Highlighting
Emacs doesn't turn on syntax highlighting by default.  This enables it globally (across all buffers).
#+begin_src emacs-lisp
(global-font-lock-mode t)
#+end_src

** Tabs Handling
This tends to be a relgious issue, but I prefer it when tabs are never used in any of my work.  This tells Emacs to indent with spaces rather than tabs, and set a tab width to be four spaces.
#+begin_src emacs-lisp
(setq-default indent-tabs-mode nil)
(setq-default tab-width 4)
#+end_src

** Minibuffer Handling
There are a variety of helper modes that improve the file finding and buffer switching functionality.  I used to use =iswitchb-mode=, which affects only buffer switching, but now use the more comprehensive =ido-mode=, which affects file finding as well.
#+begin_src emacs-lisp
(ido-mode t)
#+end_src

** Modeline Information
By default, the modeline doesn't contain a lot of information.  These commands add time, CPU load, battery information and column number information for the current point position.
#+begin_src emacs-lisp
(display-time-mode t)
(column-number-mode t)
(display-battery-mode t)
#+end_src

** Scrolling
One of the best changes to Emacs' default behavior, this modifies the scrolling behavior to maintain better continuity.  The default behavior is jumpy and disorienting for me.  Most other editors are better, but only scroll when you hit the bottom or top of the screen.  This modification makes Emacs behave like other editors, but places a 10-line margin at the top of the bottom of the screen so when the screen begins scrolling, you have some context surrounding the point.
#+begin_src emacs-lisp
(setq scroll-conservatively 10)
(setq scroll-margin 7)
(setq inhibit-startup-screen 1)
#+end_src
** Paretheses
If the cursor is on a parenthesis, bracket or brace, this mode highlights the corresponding parenthesis, bracket or brace.  Very handy in a lot of situations, most notably when programming in lisp.
#+begin_src emacs-lisp
(show-paren-mode t)
#+end_src
** Line Wrapping
There are lots of ways to handle line wrapping, but this mode is the best I've found, by far.  It does not insert hard newlines into your document, and behaves correctly /vis a vis/ line numbers.
#+begin_src emacs-lisp
(global-visual-line-mode 1)
#+end_src
** Emacs Server
The idiomatic way to use Emacs is to keep one Emacs session running, and open new files in that session.  This can be inconvenient when you're in another application and want to open a file it is pointing to.  Often, such applications support the "Open with..." command, but you'd need a way to tell them to open the file with the currently running Emacs session.  The way to do this is to have your Emacs session run in server mode (which is the piece of code below), and use the command =emacsclient= to open the file; =emacsclient= will take care of handing the file off the current Emacs session.
#+begin_src emacs-lisp
(server-start)
#+end_src
** Applications
I don't add on too many non-default applications, but sunrise commander is so good that I couldn't resist.  It is on OFM (orthodox file manager) that is built as a front-end to dired-mode that I find quite useful for its dual-pane functionality.
*** Sunrise Commander
#+begin_src emacs-lisp
(require 'sunrise-commander)
#+end_src
** Modes
There a variety of modes that I'd like to be available during my editing session, but I don't want to sacrifice startup speed to have them, since I won't be using them immediately, usually.  =idle-require= tells emacs to load them when convenient, rather than hold up the initialization process loading them.
#+begin_src emacs-lisp
(idle-require 'htmlize)
(idle-require 'clojure-mode)
(idle-require 'remember)
(idle-require 'org-remember)
(idle-require 'org-export-latex)
#+end_src
*** ANSI Color in Terminals
(ansi-color-for-comint-mode-on)
*** =recentf= Setup
#+begin_src emacs-lisp
(recentf-mode t)
(setq recentf-auto-cleanup 'never)
#+end_src
*** Org-Remember
=remember-mode= is great for capturing tasks and information that you need to remember, and org-mode offers a great set of additional functionality that tie in with remember.
#+begin_src emacs-lisp
(org-remember-insinuate)
(setq org-directory (expand-file-name "jungledisk" (file-name-as-directory "~")))
(setq org-default-notes-file (expand-file-name "sidebrain.org" org-directory))
#+end_src

#+begin_src emacs-lisp
  (setq org-remember-templates
        '(("Incoming" ?i "** %t: %?\n  %i\n  %a" "~/jungledisk/sidebrain.org" "Incoming")))
#+end_src

