emacs.html

<div id="outline-container-3_4" class="outline-3">
<h3 id="sec-3_4"><span class="section-number-3">3.4</span> Meta Key Modifications </h3>
<div class="outline-text-3" id="text-3_4">

<p>On many platform/keyboard combinations, keys are not placed conveniently for use in Emacs.  Specifically, the control key is often placed in the lower left corner of the keyboard, which can cause strain.  This is usually rebound to a more convenient location (like the key that most modern keyboards assign to Caps Lock).  The other key that sometimes causes issues is the Meta key, and that is what we address here.  If you're using Emacs on Apple hardware with an Apple keyboard, for example, the "Command" key should be treated as Meta.  This can be effected with:
</p>


<pre class="src src-emacs-lisp">(setq ns-command-modifier (quote meta))
</pre>


<p>
It's worth noting that this variable doesn't even exist on non-Apple platforms, and may or may not be present in alternative builds like Carbon Emacs and Aquamacs, which have their own methods for handling Meta key behavior on Apple platforms.
</p>
<p>
Similar techniques can be used to assign Meta on Linux, as well:
</p>


<pre class="src src-emacs-lisp">(setq x-alt-keysym 'meta)
(setq x-super-keysym 'meta)
</pre>


</div>

</div>

<div id="outline-container-3_5" class="outline-3">
<h3 id="sec-3_5"><span class="section-number-3">3.5</span> Syntax Highlighting </h3>
<div class="outline-text-3" id="text-3_5">

<p>Emacs doesn't turn on syntax highlighting by default.  This enables it globally (across all buffers).
</p>


<pre class="src src-emacs-lisp">(global-font-lock-mode t)
</pre>



</div>

</div>

<div id="outline-container-3_6" class="outline-3">
<h3 id="sec-3_6"><span class="section-number-3">3.6</span> Tabs Handling </h3>
<div class="outline-text-3" id="text-3_6">

<p>This tends to be a relgious issue, but I prefer it when tabs are never used in any of my work.  This tells Emacs to indent with spaces rather than tabs, and set a tab width to be four spaces.
</p>


<pre class="src src-emacs-lisp">(setq-default indent-tabs-mode nil)
(setq-default tab-width 4)
</pre>



</div>

</div>

<div id="outline-container-3_7" class="outline-3">
<h3 id="sec-3_7"><span class="section-number-3">3.7</span> Minibuffer Handling </h3>
<div class="outline-text-3" id="text-3_7">

<p>There are a variety of helper modes that improve the file finding and buffer switching functionality.  I used to use <code>iswitchb-mode</code>, which affects only buffer switching, but now use the more comprehensive <code>ido-mode</code>, which affects file finding as well.
</p>


<pre class="src src-emacs-lisp">(ido-mode t)
</pre>



</div>

</div>

<div id="outline-container-3_8" class="outline-3">
<h3 id="sec-3_8"><span class="section-number-3">3.8</span> Modeline Information </h3>
<div class="outline-text-3" id="text-3_8">

<p>By default, the modeline doesn't contain a lot of information.  These commands add time, CPU load, battery information and column number information for the current point position.
</p>


<pre class="src src-emacs-lisp">(display-time-mode t)
(column-number-mode t)
(display-battery-mode t)
</pre>



</div>

</div>

<div id="outline-container-3_9" class="outline-3">
<h3 id="sec-3_9"><span class="section-number-3">3.9</span> Scrolling </h3>
<div class="outline-text-3" id="text-3_9">

<p>One of the best changes to Emacs' default behavior, this modifies the scrolling behavior to maintain better continuity.  The default behavior is jumpy and disorienting for me.  Most other editors are better, but only scroll when you hit the bottom or top of the screen.  This modification makes Emacs behave like other editors, but places a 10-line margin at the top of the bottom of the screen so when the screen begins scrolling, you have some context surrounding the point.
</p>


<pre class="src src-emacs-lisp">(setq scroll-conservatively 10)
(setq scroll-margin 7)
(setq inhibit-startup-screen 1)
</pre>


</div>

</div>

<div id="outline-container-3_10" class="outline-3">
<h3 id="sec-3_10"><span class="section-number-3">3.10</span> Paretheses </h3>
<div class="outline-text-3" id="text-3_10">

<p>If the cursor is on a parenthesis, bracket or brace, this mode highlights the corresponding parenthesis, bracket or brace.  Very handy in a lot of situations, most notably when programming in lisp.
</p>


<pre class="src src-emacs-lisp">(show-paren-mode t)
</pre>


</div>

</div>

<div id="outline-container-3_11" class="outline-3">
<h3 id="sec-3_11"><span class="section-number-3">3.11</span> Line Wrapping </h3>
<div class="outline-text-3" id="text-3_11">

<p>There are lots of ways to handle line wrapping, but this mode is the best I've found, by far.  It does not insert hard newlines into your document, and behaves correctly <i>vis a vis</i> line numbers.
</p>


<pre class="src src-emacs-lisp">(global-visual-line-mode 1)
</pre>


</div>

</div>

<div id="outline-container-3_12" class="outline-3">
<h3 id="sec-3_12"><span class="section-number-3">3.12</span> Emacs Server </h3>
<div class="outline-text-3" id="text-3_12">

<p>The idiomatic way to use Emacs is to keep one Emacs session running, and open new files in that session.  This can be inconvenient when you're in another application and want to open a file it is pointing to.  Often, such applications support the "Open with&hellip;" command, but you'd need a way to tell them to open the file with the currently running Emacs session.  The way to do this is to have your Emacs session run in server mode (which is the piece of code below), and use the command <code>emacsclient</code> to open the file; <code>emacsclient</code> will take care of handing the file off the current Emacs session.
</p>


<pre class="src src-emacs-lisp">(server-start)
</pre>


</div>

</div>

<div id="outline-container-3_13" class="outline-3">
<h3 id="sec-3_13"><span class="section-number-3">3.13</span> Applications </h3>
<div class="outline-text-3" id="text-3_13">

<p>I don't add on too many non-default applications, but sunrise commander is so good that I couldn't resist.  It is on OFM (orthodox file manager) that is built as a front-end to dired-mode that I find quite useful for its dual-pane functionality.
</p>
</div>

<div id="outline-container-3_13_1" class="outline-4">
<h4 id="sec-3_13_1"><span class="section-number-4">3.13.1</span> Sunrise Commander </h4>
<div class="outline-text-4" id="text-3_13_1">




<pre class="src src-emacs-lisp">(<span style="color: #00ffff;">require</span> '<span style="color: #7fffd4;">sunrise-commander</span>)
</pre>


</div>
</div>

</div>

<div id="outline-container-3_14" class="outline-3">
<h3 id="sec-3_14"><span class="section-number-3">3.14</span> Modes </h3>
<div class="outline-text-3" id="text-3_14">

<p>There a variety of modes that I'd like to be available during my editing session, but I don't want to sacrifice startup speed to have them, since I won't be using them immediately, usually.  <code>idle-require</code> tells emacs to load them when convenient, rather than hold up the initialization process loading them.
</p>


<pre class="src src-emacs-lisp">(idle-require 'htmlize)
(idle-require 'clojure-mode)
(idle-require 'remember)
(idle-require 'org-remember)
(idle-require 'org-export-latex)
</pre>



</div>

<div id="outline-container-3_14_1" class="outline-4">
<h4 id="sec-3_14_1"><span class="section-number-4">3.14.1</span> ANSI Color in Terminals </h4>
<div class="outline-text-4" id="text-3_14_1">

<p>(ansi-color-for-comint-mode-on)
</p></div>

</div>

<div id="outline-container-3_14_2" class="outline-4">
<h4 id="sec-3_14_2"><span class="section-number-4">3.14.2</span> <code>recentf</code> Setup </h4>
<div class="outline-text-4" id="text-3_14_2">




<pre class="src src-emacs-lisp">(recentf-mode t)
(setq recentf-auto-cleanup 'never)
</pre>


</div>

</div>

<div id="outline-container-3_14_3" class="outline-4">
<h4 id="sec-3_14_3"><span class="section-number-4">3.14.3</span> Org-Remember </h4>
<div class="outline-text-4" id="text-3_14_3">

<p><code>remember-mode</code> is great for capturing tasks and information that you need to remember, and org-mode offers a great set of additional functionality that tie in with remember.
</p>


<pre class="src src-emacs-lisp">(org-remember-insinuate)
(setq org-directory (expand-file-name <span style="color: #ffa07a;">"jungledisk"</span> (file-name-as-directory <span style="color: #ffa07a;">"~"</span>)))
(setq org-default-notes-file (expand-file-name <span style="color: #ffa07a;">"sidebrain.org"</span> org-directory))
</pre>




<pre class="src src-emacs-lisp">(setq org-remember-templates
      '((<span style="color: #ffa07a;">"Incoming"</span> ?i <span style="color: #ffa07a;">"** %t: %?\n  %i\n  %a"</span> <span style="color: #ffa07a;">"~/jungledisk/sidebrain.org"</span> <span style="color: #ffa07a;">"Incoming"</span>)))
</pre>



</div>
</div>

</div>
