emacs.org
** Accelerators
As seen in Steve Yegge's discussion on Effective Emacs, these three settings change some default behavior to speed up common actions.
Here, we enable the use of C-x C-m to provide the same functionality as M-x provides.  Why? See [[http://sites.google.com/site/steveyegge2/effective-emacs][Effective Emacs]], Item 2.
#+begin_src emacs-lisp
(global-set-key "\C-x\C-m" 'execute-extended-command)
#+end_src

Also from Effective Emacs, this is item 3, which allows us to be able to =backward-kill-word= without having to reach for the backspace key.
#+begin_src emacs-lisp
(global-set-key "\C-w" 'backward-kill-word)
(global-set-key "\C-x\C-k" 'kill-region)
#+end_src

I use several functions very often, so I like to be able to access them very quickly.  These accelerators proide that quick access.
#+begin_src emacs-lisp
(global-set-key "\C-xq" 'anything)
(global-set-key "\C-xj" 'join-line)
(global-set-key "\C-xi" 'imenu)
(global-set-key "\C-xf" 'recentf-open-files)
(global-set-key "\C-xc" 'calendar)
(global-set-key "\C-xt" 'eshell)
(global-set-key "\C-xs" 'flyspell-on)
(global-set-key "\C-xc" 'search)
(global-set-key "\C-ca" 'org-agenda)
(global-set-key "\C-cr" 'org-remember)
#+end_src

** GUI Settings
#+begin_src emacs-lisp
  (tool-bar-mode -1)
  (menu-bar-mode -1)
  (scroll-bar-mode -1)
#+end_src
** End of File Newlines
There are two aspects to the following customizations.  First, there are a bunch of tools out there that rely on text files ending with a newline to operate correctly.  This setting ensures that a newline is inserted if one does not exist when we save files with Emacs.
#+begin_src emacs-lisp
(setq require-final-newline t)
#+end_src

The second customization disables a mode in which Emacs automatically adds newline characters if you tell it to move to the next line at the end of a buffer.
#+begin_src emacs-lisp
(setq next-line-add-newlines nil)
#+end_src
** Advanced Commands
There are a variety of commands that Emacs considers "advanced", and will therefore disallow execution of until you affirm (via a prompt) that you actually want to use them.  These commands tell Emacs not to do this for commands I use.
#+begin_src emacs-lisp
(put 'narrow-to-region 'disabled nil)
(put 'dired-find-alternate-file 'disabled nil)
(put 'set-goal-column 'disabled nil)
#+end_src
** Color Themes
Color themes should be incuded in Emacs, but they're not.  These commands simply load the =color-theme= library and select my current favority color theme.
#+begin_src emacs-lisp
(require 'color-theme)
(color-theme-initialize)
(color-theme-comidia)
#+end_src
* Location-specific Settings
Most of the customizations so far carry well across computers.  These, however, point Emacs to outside resources on the system on which the customization resides, so they will need to be changed from platform to platform.  The first sets my default lisp interpreter to be [[http://clojure.org][Clojure]] running on the JVM, and the second sets my default scheme program to be [[http://dynamo.iro.umontreal.ca/~gambit/wiki/index.php/Main_Page][Gambit Scheme]].
#+begin_src emacs-lisp
(setq-default inferior-lisp-program "java -jar /home/rpdillon/apps/clojure/clojure.jar")
(setq-default scheme-program-name "gsi")
#+end_src
