emacs.html

<div id="outline-container-3_15" class="outline-3">
<h3 id="sec-3_15"><span class="section-number-3">3.15</span> Accelerators </h3>
<div class="outline-text-3" id="text-3_15">

<p>As seen in Steve Yegge's discussion on Effective Emacs, these three settings change some default behavior to speed up common actions.
Here, we enable the use of C-x C-m to provide the same functionality as M-x provides.  Why? See <a href="http://sites.google.com/site/steveyegge2/effective-emacs">Effective Emacs</a>, Item 2.
</p>


<pre class="src src-emacs-lisp">(global-set-key <span style="color: #ffa07a;">"\C-x\C-m"</span> 'execute-extended-command)
</pre>



<p>
Also from Effective Emacs, this is item 3, which allows us to be able to <code>backward-kill-word</code> without having to reach for the backspace key.
</p>


<pre class="src src-emacs-lisp">(global-set-key <span style="color: #ffa07a;">"\C-w"</span> 'backward-kill-word)
(global-set-key <span style="color: #ffa07a;">"\C-x\C-k"</span> 'kill-region)
</pre>



<p>
I use several functions very often, so I like to be able to access them very quickly.  These accelerators proide that quick access.
</p>


<pre class="src src-emacs-lisp">(global-set-key <span style="color: #ffa07a;">"\C-xq"</span> 'anything)
(global-set-key <span style="color: #ffa07a;">"\C-xj"</span> 'join-line)
(global-set-key <span style="color: #ffa07a;">"\C-xi"</span> 'imenu)
(global-set-key <span style="color: #ffa07a;">"\C-xf"</span> 'recentf-open-files)
(global-set-key <span style="color: #ffa07a;">"\C-xc"</span> 'calendar)
(global-set-key <span style="color: #ffa07a;">"\C-xt"</span> 'eshell)
(global-set-key <span style="color: #ffa07a;">"\C-xs"</span> 'flyspell-on)
(global-set-key <span style="color: #ffa07a;">"\C-xc"</span> 'search)
(global-set-key <span style="color: #ffa07a;">"\C-ca"</span> 'org-agenda)
(global-set-key <span style="color: #ffa07a;">"\C-cr"</span> 'org-remember)
</pre>



</div>

</div>

<div id="outline-container-3_16" class="outline-3">
<h3 id="sec-3_16"><span class="section-number-3">3.16</span> GUI Settings </h3>
<div class="outline-text-3" id="text-3_16">




<pre class="src src-emacs-lisp">(tool-bar-mode -1)
(menu-bar-mode -1)
(scroll-bar-mode -1)
</pre>


</div>

</div>

<div id="outline-container-3_17" class="outline-3">
<h3 id="sec-3_17"><span class="section-number-3">3.17</span> End of File Newlines </h3>
<div class="outline-text-3" id="text-3_17">

<p>There are two aspects to the following customizations.  First, there are a bunch of tools out there that rely on text files ending with a newline to operate correctly.  This setting ensures that a newline is inserted if one does not exist when we save files with Emacs.
</p>


<pre class="src src-emacs-lisp">(setq require-final-newline t)
</pre>



<p>
The second customization disables a mode in which Emacs automatically adds newline characters if you tell it to move to the next line at the end of a buffer.
</p>


<pre class="src src-emacs-lisp">(setq next-line-add-newlines nil)
</pre>


</div>

</div>

<div id="outline-container-3_18" class="outline-3">
<h3 id="sec-3_18"><span class="section-number-3">3.18</span> Advanced Commands </h3>
<div class="outline-text-3" id="text-3_18">

<p>There are a variety of commands that Emacs considers "advanced", and will therefore disallow execution of until you affirm (via a prompt) that you actually want to use them.  These commands tell Emacs not to do this for commands I use.
</p>


<pre class="src src-emacs-lisp">(put 'narrow-to-region 'disabled nil)
(put 'dired-find-alternate-file 'disabled nil)
(put 'set-goal-column 'disabled nil)
</pre>


</div>

</div>

<div id="outline-container-3_19" class="outline-3">
<h3 id="sec-3_19"><span class="section-number-3">3.19</span> Color Themes </h3>
<div class="outline-text-3" id="text-3_19">

<p>Color themes should be incuded in Emacs, but they're not.  These commands simply load the <code>color-theme</code> library and select my current favority color theme.
</p>


<pre class="src src-emacs-lisp">(<span style="color: #00ffff;">require</span> '<span style="color: #7fffd4;">color-theme</span>)
(color-theme-initialize)
(color-theme-comidia)
</pre>


</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Location-specific Settings </h2>
<div class="outline-text-2" id="text-4">

<p>Most of the customizations so far carry well across computers.  These, however, point Emacs to outside resources on the system on which the customization resides, so they will need to be changed from platform to platform.  The first sets my default lisp interpreter to be <a href="http://clojure.org">Clojure</a> running on the JVM, and the second sets my default scheme program to be <a href="http://dynamo.iro.umontreal.ca/~gambit/wiki/index.php/Main_Page">Gambit Scheme</a>.
</p>


<pre class="src src-emacs-lisp">(setq-default inferior-lisp-program <span style="color: #ffa07a;">"java -jar /home/rpdillon/apps/clojure/clojure.jar"</span>)
(setq-default scheme-program-name <span style="color: #ffa07a;">"gsi"</span>)
</pre>


</div>
</div>
<div id="postamble">
<p class="author"> Author: R. P. Dillon
</p>
<p class="date"> Date: 2010-07-10 Sat</p>
<p class="creator">HTML generated by org-mode 6.36trans in emacs 23</p>
</div>
</div>
</body>
</html>
